Repository: haitao-sjsu/VoiceBabel
Catalog: WhisperUtil/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt, ru, zh_hans, zh_hant

source: API Key
de: API-Schlüssel
es: Clave API
fr: Clé API
ja: APIキー
ko: API 키
pt: Chave API
ru: API-ключ
zh_hans: API 密钥
zh_hant: API 密鑰

source: API Key Valid
de: API-Schlüssel gültig
es: Clave API válida
fr: Clé API valide
ja: APIキー有効
ko: API 키 유효
pt: Chave API válida
ru: API-ключ действителен
zh_hans: 密钥有效
zh_hant: 密鑰有效

source: API Key required for cloud transcription and translation
de: API-Schlüssel für Cloud-Transkription und Übersetzung erforderlich
es: Se requiere clave API para transcripción y traducción en la nube
fr: Clé API requise pour la transcription et la traduction cloud
ja: クラウド文字起こしと翻訳にはAPIキーが必要です
ko: 클라우드 전사 및 번역에 API 키가 필요합니다
pt: Chave API necessária para transcrição e tradução na nuvem
ru: Для облачной транскрипции и перевода требуется API-ключ
zh_hans: 需要 API Key 才能使用网络转写和翻译功能
zh_hant: 需要 API Key 才能使用網路轉寫和翻譯功能

source: Validate
de: Überprüfen
es: Validar
fr: Valider
ja: 検証
ko: 검증
pt: Validar
ru: Проверить
zh_hans: 验证
zh_hant: 驗證

source: Clear
de: Löschen
es: Borrar
fr: Effacer
ja: クリア
ko: 지우기
pt: Limpar
ru: Очистить
zh_hans: 清除
zh_hant: 清除

source: Language
de: Sprache
es: Idioma
fr: Langue
ja: 言語
ko: 언어
pt: Idioma
ru: Язык
zh_hans: 语言
zh_hant: 語言

source: Recognition Language
de: Erkennungssprache
es: Idioma de reconocimiento
fr: Langue de reconnaissance
ja: 認識言語
ko: 인식 언어
pt: Idioma de reconhecimento
ru: Язык распознавания
zh_hans: 识别语言
zh_hant: 辨識語言

source: Auto Detect
de: Automatische Erkennung
es: Detección automática
fr: Détection automatique
ja: 自動検出
ko: 자동 감지
pt: Detecção automática
ru: Автоопределение
zh_hans: 自动检测
zh_hant: 自動偵測

source: Same as Interface
de: Wie Oberfläche
es: Igual que la interfaz
fr: Identique à l'interface
ja: インターフェース言語と同じ
ko: 인터페이스 언어와 동일
pt: Mesmo que a interface
ru: Как интерфейс
zh_hans: 与界面语言一致
zh_hant: 與介面語言一致

source: Transcription
de: Transkription
es: Transcripción
ja: 文字起こし
ko: 전사
pt: Transcrição
ru: Транскрипция
zh_hans: 转写
zh_hant: 轉寫

source: Default API Mode
de: Standard-API-Modus
es: Modo API predeterminado
fr: Mode API par défaut
ja: デフォルトAPIモード
ko: 기본 API 모드
pt: Modo API padrão
ru: Режим API по умолчанию
zh_hans: 默认 API 模式
zh_hant: 預設 API 模式

source: Text Cleanup
de: Textbereinigung
es: Limpieza de texto
fr: Nettoyage du texte
ja: テキスト最適化
ko: 텍스트 정리
pt: Limpeza de texto
ru: Очистка текста
zh_hans: 文本优化
zh_hant: 文字優化

source: Off
de: Aus
es: Desactivado
fr: Désactivé
ja: オフ
ko: 끄기
pt: Desativado
ru: Выкл
zh_hans: 关闭
zh_hant: 關閉

source: Translation
de: Übersetzung
es: Traducción
fr: Traduction
ja: 翻訳
ko: 번역
pt: Tradução
ru: Перевод
zh_hans: 翻译
zh_hant: 翻譯

source: Output Language
de: Ausgabesprache
es: Idioma de salida
fr: Langue de sortie
ja: 出力言語
ko: 출력 언어
pt: Idioma de saída
ru: Язык вывода
zh_hans: 输出语言
zh_hant: 輸出語言

source: General
de: Allgemein
fr: Général
ja: 一般
ko: 일반
pt: Geral
ru: Основные
zh_hans: 通用
zh_hant: 一般

source: Interface Language
de: Oberflächensprache
es: Idioma de interfaz
fr: Langue de l'interface
ja: インターフェース言語
ko: 인터페이스 언어
pt: Idioma da interface
ru: Язык интерфейса
zh_hans: 界面语言
zh_hant: 介面語言

source: Follow System
de: System folgen
es: Seguir sistema
fr: Suivre le système
ja: システムに従う
ko: 시스템 따라가기
pt: Seguir sistema
ru: Как в системе
zh_hans: 跟随系统
zh_hant: 跟隨系統

source: Send Mode
de: Sendemodus
es: Modo de envío
fr: Mode d'envoi
ja: 送信モード
ko: 전송 모드
pt: Modo de envio
ru: Режим отправки
zh_hans: 发送模式
zh_hant: 傳送模式

source: Transcribe Only
de: Nur Transkription
es: Solo transcribir
fr: Transcription seule
ja: 文字起こしのみ
ko: 전사만
pt: Apenas transcrever
ru: Только транскрипция
zh_hans: 仅转写
zh_hant: 僅轉寫

source: Delay: %lld seconds
de: Verzögerung: %lld Sekunden
es: Retraso: %lld segundos
fr: Délai: %lld secondes
ja: 遅延: %lld 秒
ko: 지연: %lld 초
pt: Atraso: %lld segundos
ru: Задержка: %lld сек
zh_hans: 延迟时间: %lld 秒
zh_hant: 延遲時間: %lld 秒

source: Play Sound Effects
de: Soundeffekte abspielen
es: Reproducir efectos de sonido
fr: Jouer les effets sonores
ja: サウンド効果を再生
ko: 효과음 재생
pt: Reproduzir efeitos sonoros
ru: Воспроизводить звуки
zh_hans: 播放提示音
zh_hant: 播放提示音

source: 🎤 Start Transcription (⌥)
de: 🎤 Transkription starten (⌥)
es: 🎤 Iniciar transcripción (⌥)
fr: 🎤 Démarrer la transcription (⌥)
ja: 🎤 文字起こし開始 (⌥)
ko: 🎤 전사 시작 (⌥)
pt: 🎤 Iniciar transcrição (⌥)
ru: 🎤 Начать транскрипцию (⌥)
zh_hans: 🎤 开始转录 (⌥)
zh_hant: 🎤 開始轉錄 (⌥)

source: 🌐 Start Translation (⌥⌥)
de: 🌐 Übersetzung starten (⌥⌥)
es: 🌐 Iniciar traducción (⌥⌥)
fr: 🌐 Démarrer la traduction (⌥⌥)
ja: 🌐 翻訳開始 (⌥⌥)
ko: 🌐 번역 시작 (⌥⌥)
pt: 🌐 Iniciar tradução (⌥⌥)
ru: 🌐 Начать перевод (⌥⌥)
zh_hans: 🌐 开始翻译 (⌥⌥)
zh_hant: 🌐 開始翻譯 (⌥⌥)

source: Settings...
de: Einstellungen...
es: Ajustes...
fr: Paramètres...
ja: 設定...
ko: 설정...
pt: Configurações...
ru: Настройки...
zh_hans: 设置...
zh_hant: 設定...

source: Quit
de: Beenden
es: Salir
fr: Quitter
ja: 終了
ko: 종료
pt: Sair
ru: Выход
zh_hans: 退出
zh_hant: 結束

source: WhisperUtil Settings
de: WhisperUtil Einstellungen
es: Ajustes de WhisperUtil
fr: Paramètres WhisperUtil
ja: WhisperUtil 設定
ko: WhisperUtil 설정
pt: Configurações do WhisperUtil
ru: Настройки WhisperUtil
zh_hans: WhisperUtil 设置
zh_hant: WhisperUtil 設定

source: Get API Key
ja: APIキーを取得
ko: API 키 받기
zh_hans: 获取 API Key
zh_hant: 取得 API Key

source: Local (WhisperKit)
ja: ローカル (WhisperKit)
ko: 로컬 (WhisperKit)
zh_hans: 本地识别 (WhisperKit)
zh_hant: 本機辨識 (WhisperKit)

source: Cloud API
ja: クラウドAPI
ko: 클라우드 API
zh_hans: 网络 API
zh_hant: 網路 API

source: Realtime API
ja: リアルタイムAPI
ko: 실시간 API
zh_hans: 实时 API
zh_hant: 即時 API

source: Natural
ja: ナチュラル
ko: 자연스럽게
zh_hans: 自然润色
zh_hant: 自然潤色

source: Formal
ja: フォーマル
ko: 격식체
zh_hans: 正式风格
zh_hant: 正式風格

source: Casual
ja: カジュアル
ko: 구어체
zh_hans: 口语风格
zh_hant: 口語風格

source: Transcribe + Auto Send
ja: 文字起こし+自動送信
ko: 전사+자동 전송
zh_hans: 转写+自动发送
zh_hant: 轉寫+自動傳送

source: Transcribe + Delayed Send
ja: 文字起こし+遅延送信
ko: 전사+지연 전송
zh_hans: 转写+延迟发送
zh_hant: 轉寫+延遲傳送

source: Copy & Paste Last Transcription:
ja: 前回の文字起こしをコピー&ペースト:
ko: 마지막 전사 복사 및 붙여넣기:
zh_hans: 复制并粘贴上次转写:
zh_hant: 複製並貼上上次轉寫:

source: (None)
ja: (なし)
ko: (없음)
zh_hans: (无)
zh_hant: (無)

source: About WhisperUtil
ja: WhisperUtil について
ko: WhisperUtil 정보
zh_hans: 关于 WhisperUtil
zh_hant: 關於 WhisperUtil

source: ⏹ Stop Recording
ja: ⏹ 録音停止
ko: ⏹ 녹음 중지
zh_hans: ⏹ 停止录音
zh_hant: ⏹ 停止錄音

source: ⏳ Processing...
ja: ⏳ 処理中...
ko: ⏳ 처리 중...
zh_hans: ⏳ 处理中...
zh_hant: ⏳ 處理中...

source: ⏳ Waiting to Send... (tap ⌥ to cancel)
ja: ⏳ 送信待ち... (⌥でキャンセル)
ko: ⏳ 전송 대기... (⌥로 취소)
zh_hans: ⏳ 等待发送... (单击⌥取消)
zh_hant: ⏳ 等待傳送... (點擊⌥取消)

source: Version
ja: バージョン
ko: 버전
zh_hans: 版本
zh_hant: 版本

source: Speech-to-text & translation tool
ja: 音声テキスト変換 & 翻訳ツール
ko: 음성 텍스트 변환 & 번역 도구
zh_hans: 语音转文字 & 翻译工具
zh_hant: 語音轉文字 & 翻譯工具

source: Powered by OpenAI Whisper API
ja: OpenAI Whisper API 使用
ko: OpenAI Whisper API 기반
zh_hans: 使用 OpenAI Whisper API
zh_hant: 使用 OpenAI Whisper API

source: Features:
ja: 機能:
ko: 기능:
zh_hans: 功能:
zh_hant: 功能:

source: Speech-to-text — recognize speech and output original text
ja: 音声テキスト変換 — 音声を認識して原文を出力
ko: 음성 텍스트 변환 — 음성을 인식하여 원문 출력
zh_hans: 语音转文字 - 识别语音并输出原文
zh_hant: 語音轉文字 - 辨識語音並輸出原文

source: Speech translation — recognize speech and translate
ja: 音声翻訳 — 音声を認識して翻訳
ko: 음성 번역 — 음성을 인식하여 번역
zh_hans: 语音翻译 - 识别语音并翻译
zh_hant: 語音翻譯 - 辨識語音並翻譯

source: Loading speech recognition model, first use requires download...
ja: 音声認識モデルを読み込み中、初回はダウンロードが必要です...
ko: 음성 인식 모델 로딩 중, 첫 사용 시 다운로드 필요...
zh_hans: 正在加载语音识别模型，首次使用需下载...
zh_hant: 正在載入語音辨識模型，首次使用需下載...

source: Model loaded, local recognition ready
ja: モデル読み込み完了、ローカル認識準備完了
ko: 모델 로딩 완료, 로컬 인식 준비 완료
zh_hans: 模型加载完成，本地识别已就绪
zh_hant: 模型載入完成，本機辨識已就緒

source: Model loading failed: %@
ja: モデル読み込み失敗: %@
ko: 모델 로딩 실패: %@
zh_hans: 模型加载失败: %@
zh_hant: 模型載入失敗: %@

source: Network recovered, switched back to Cloud API
ja: ネットワーク回復、クラウドAPIに切り替えました
ko: 네트워크 복구, 클라우드 API로 전환
zh_hans: 网络已恢复，已切回网络 API
zh_hant: 網路已恢復，已切回網路 API

source: API Key cleared, switched to local mode
ja: APIキーをクリア、ローカルモードに切り替えました
ko: API 키 삭제됨, 로컬 모드로 전환
zh_hans: API Key 已清除，已切换到本地识别模式
zh_hant: API Key 已清除，已切換到本機辨識模式

source: API Key updated
ja: APIキーが更新されました
ko: API 키 업데이트됨
zh_hans: API Key 已更新
zh_hant: API Key 已更新

source: Please configure OpenAI API Key in Settings
ja: 設定でOpenAI APIキーを設定してください
ko: 설정에서 OpenAI API 키를 구성해주세요
zh_hans: 请先在设置中配置 OpenAI API Key
zh_hant: 請先在設定中配置 OpenAI API Key

source: Microphone is in use by another app
ja: マイクが他のアプリで使用中です
ko: 마이크가 다른 앱에서 사용 중입니다
zh_hans: 麦克风正被其他应用使用
zh_hant: 麥克風正被其他應用使用

source: WhisperKit model is loading, please wait...
ja: WhisperKitモデル読み込み中、お待ちください...
ko: WhisperKit 모델 로딩 중, 잠시 기다려주세요...
zh_hans: WhisperKit 模型正在加载中，请稍候...
zh_hant: WhisperKit 模型正在載入中，請稍候...

source: WhisperKit model not loaded yet, please try again later
ja: WhisperKitモデルが未ロードです、後でもう一度お試しください
ko: WhisperKit 모델이 아직 로드되지 않았습니다, 나중에 다시 시도해주세요
zh_hans: WhisperKit 模型尚未加载，请稍候再试
zh_hant: WhisperKit 模型尚未載入，請稍候再試

source: Recording start failed: %@
ja: 録音開始失敗: %@
ko: 녹음 시작 실패: %@
zh_hans: 录音启动失败: %@
zh_hant: 錄音啟動失敗: %@

source: WebSocket connection disconnected
ja: WebSocket接続が切断されました
ko: WebSocket 연결 끊김
zh_hans: WebSocket 连接断开
zh_hant: WebSocket 連接斷開

source: Cloud API failed and cannot fall back to local transcription
ja: クラウドAPIが失敗し、ローカル転写にフォールバックできません
ko: 클라우드 API 실패, 로컬 전사로 전환 불가
zh_hans: 网络 API 失败，且无法回退到本地转录
zh_hant: 網路 API 失敗，且無法回退到本機轉錄

source: Cloud API timed out, automatically switched to local recognition
ja: クラウドAPIがタイムアウト、ローカル認識に自動切替
ko: 클라우드 API 시간 초과, 자동으로 로컬 인식으로 전환
zh_hans: 网络 API 超时，已自动切换到本地识别
zh_hant: 網路 API 逾時，已自動切換到本機辨識

source: Microphone permission denied, please authorize in System Settings
ja: マイクの権限が拒否されました。システム設定で許可してください
ko: 마이크 권한이 거부되었습니다. 시스템 설정에서 권한을 부여해주세요
zh_hans: 麦克风权限被拒绝，请在系统设置中授权
zh_hant: 麥克風權限被拒絕，請在系統設定中授權

source: Audio engine creation failed
ja: オーディオエンジンの作成に失敗しました
ko: 오디오 엔진 생성 실패
zh_hans: 音频引擎创建失败
zh_hant: 音訊引擎建立失敗

source: Audio format creation failed
ja: オーディオフォーマットの作成に失敗しました
ko: 오디오 형식 생성 실패
zh_hans: 音频格式创建失败
zh_hant: 音訊格式建立失敗

source: Save failed, please retry
ja: 保存に失敗しました。再試行してください
ko: 저장 실패, 다시 시도해주세요
zh_hans: 保存失败，请重试
zh_hant: 儲存失敗，請重試

source: API Key not set
ja: APIキーが設定されていません
ko: API 키가 설정되지 않았습니다
zh_hans: 未设置 API Key
zh_hant: 未設置 API Key

source: API Key invalid or expired
ja: APIキーが無効または期限切れです
ko: API 키가 유효하지 않거나 만료됨
zh_hans: API Key 无效或已过期
zh_hant: API Key 無效或已過期

source: API Key insufficient permissions
ja: APIキーの権限が不足しています
ko: API 키 권한 부족
zh_hans: API Key 权限不足
zh_hant: API Key 權限不足

source: Realtime transcription error: %@
ja: リアルタイム文字起こしエラー: %@
ko: 실시간 전사 오류: %@
zh_hans: 实时转录错误: %@
zh_hant: 即時轉錄錯誤: %@

source: Network error: %@
ja: ネットワークエラー: %@
ko: 네트워크 오류: %@
zh_hans: 网络错误: %@
zh_hant: 網路錯誤: %@

source: Invalid response
ja: 無効なレスポンス
ko: 잘못된 응답
zh_hans: 无效的响应
zh_hant: 無效的回應

source: No data returned
ja: データが返されませんでした
ko: 반환된 데이터 없음
zh_hans: 没有返回数据
zh_hant: 沒有返回資料

source: Response decoding failed
ja: レスポンスのデコードに失敗しました
ko: 응답 디코딩 실패
zh_hans: 响应解码失败
zh_hant: 回應解碼失敗

source: WhisperKit model not loaded yet, please wait
ja: WhisperKitモデルが未ロードです、お待ちください
ko: WhisperKit 모델이 아직 로드되지 않았습니다, 기다려주세요
zh_hans: WhisperKit 模型尚未加载，请稍候
zh_hant: WhisperKit 模型尚未載入，請稍候

source: No audio data available for transcription
ja: 文字起こし用の音声データがありません
ko: 전사에 사용할 오디오 데이터 없음
zh_hans: 没有音频数据可供转录
zh_hant: 沒有音訊資料可供轉錄

source: Invalid WebSocket URL
ja: 無効なWebSocket URL
ko: 잘못된 WebSocket URL
zh_hans: 无效的 WebSocket URL
zh_hant: 無效的 WebSocket URL

source: OK
ko: 확인
zh_hans: 确定
zh_hant: 確定
